pascal-4.0/tutorials/multiPhysics/interTrackEddyCurrentFoam/amf3D/system/solverProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      eddyCurrentProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

regions
{
    CONDUCTOR               region_conductor;
    FLUID                   region_fluid;
    BUFFER                  region_buffer;
}

settings
{
//     lowFrequency            true;
    biotSavart              true;
    lorentzForce            true;
    magneticPressure        false;
    jouleHeat               false;

    region_fluid
    {
        volumeForce         true;
        snGradpFromFlux     true;
    }
}

storage
{
    "(VReGrad|VImGrad)"
    {
        write               true;
    }

//     "(BRe|BIm)"
//     {
//         write               false;
//     }
//
//     "F"
//     {
//         write               false;
//     }
//
//     region_conductor
//     {
//         "(jRe|jIm)"
//         {
//             write           false;
//         }
//     }
}

// ************************************************************************* //
